homework/hw1/300mm/re_number/poiseuille_flow_axissymetric_distribution_0.8/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

runApplication blockMesh
runApplication $application