homework/hw1/300mm/re_number/poiseuille_flow_axissymetric_distribution_0.8/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       23660;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       23700;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       23740;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          12000;
        startFace       24040;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          12000;
        startFace       36040;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       48040;
    }
)

// ************************************************************************* //
